app/views/books/edit.html.erb

  		<%=f.label :Authors%>
		<%@book.authors.each do |p|%>
---
SELECT `authors`.* FROM `authors` WHERE `authors`.`book_id` = 1