app/controllers/books_controller.rb

  def create
  	@book=Book.new(book_params)
  	if @book.save
---
INSERT INTO `books` (`title`, `publisher`, `isbn`, `publishing_date`, `created_at`, `updated_at`) VALUES ('gg', 'gg', 'gg', '2003-01-30', '2017-09-24 07:17:45', '2017-09-24 07:17:45')